In [ ]:
"""
topics covered in this notebook

updating columns

updating entire row

updating few values in a row

updating single value in a row

apply()

applymap()

map()

replace()

"""

In [94]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [95]:
import pandas as pd

In [96]:
df = pd.DataFrame(people)

In [97]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [98]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

updating columns

In [99]:
df.columns = ['first_name','last_name','email']

In [100]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [101]:
df.columns = (x.upper() for x in df.columns)

In [102]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [103]:
df.columns = (x.lower() for x in df.columns)

In [104]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [105]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)

In [106]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

updating rows

In [107]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [55]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [110]:
df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']

In [111]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [112]:
df.loc[2,'last'] = 'Smith'

In [59]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [113]:
df.at[2, 'last'] = 'Doe'

In [114]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [115]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last'] = 'Smith'

C:\Users\gangu\AppData\Local\Temp\ipykernel_3340\1842663546.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [116]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt,'last'] = 'Smith'

In [117]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [118]:
df['email'] = df['email'].str.lower()

In [119]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

apply

In [120]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [121]:
def updateemail(email):
    return email.upper()

In [122]:
df['email'].apply(updateemail)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [123]:
df['email'] = df['email'].apply(updateemail)

In [124]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [125]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [126]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [127]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [128]:
df.apply(len,axis='columns')

0    3
1    3
2    3
dtype: int64

In [129]:
len(df['email'])

3

In [130]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [131]:
df.apply(lambda x : x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

applymap

In [132]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [133]:
df.applymap(lambda x : x.lower())

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

map

In [134]:
df['first'].map({'Corey':'chris','Jane':'mary'})

0    chris
1     mary
2      NaN
Name: first, dtype: object

replace

In [135]:
df['first'] = df['first'].replace({'Corey':'Chris','Jane':'Mary'})

In [136]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com